package com.st.ufsCluster.etl.word

import org.apache.spark.SparkConf
import org.apache.spark.SparkContext
import org.apache.spark.broadcast.Broadcast
import org.apache.spark.sql.SQLContext
import org.apache.spark.rdd.RDD.rddToOrderedRDDFunctions
import org.apache.spark.rdd.RDD.rddToPairRDDFunctions
/**
 * @author socket
 */
object WordETLBinary {
  val recipes = "731,1,3元,70,70土,80后,Laksa,M3,Q,TALK,Tacos,Uncle,XO,ga,mini,taco,一个,一代,一口,一味,一品,一品锅,一哥,一四一六,一块,一座,一心,一把,一指禅,一桶,一筐,一米,一级,一绝,一般,一蟹,一锅,一锅鲜,一面,一鱼,一鸭,丁,万丽,万家,万峦,三,三丁包,三丝,三件,三凤桥,三剁,三十,三合,三味,三国,三宝,三寸,三少,三层,三峡,三文,三文鱼,三明治,三杯,三样,三白,三素,三绝,三色,三花,三蒸,三角,三道,三鲜,三黄,上,上上签,上和,上将,上楼,上汤,上海,上瘾,上酱,下巴,不,不一样的,不腻,与,丑鱼,世宁,东京,东北,东坡,东坡肉,东安,东山,东星,东来顺,东阳,丝,丝丁,丝卷,丝绒,两,两样,两桶,两江,两面,两食,中,中8牌玖,中华,中锅,丰收,丰茂,串,串串,串串香,串儿,串烧,丸,丸子,丹东,主义,主厨,丽湖,久香,义气,之,乌江,乌珠穆沁,乌鱼蛋,乌鲳,乌鸡,乐汇,九尺,九层,九格,九福,九肚,九肚鱼,九转,九香,乡巴佬,乡村,乱炖,乳,乳Q,乳牛,乳猪,乳酪,乳酸菌,乳鸽,乾隆,了,二道桥,云南,云吞,云杉,云腾,五件,五哥,五彩,五方,五花,五花肉,五谷丰登,五谷杂粮,五颜六色,五香,五魁,井冈山,井水,京,京味,京城,京天,京烧,京都,京酱,亮,人间,什果,什菜,什锦,仁,仁和,仔,仔包,仔姜爆,仔排,仔粥,们,任性,伊府,优质,会,传统,传香,似蜜,低温,何师,佛跳墙,例汤,侧边,俄式,俄罗斯,保真,俵笋,俺家,偷,傣味,傣家,儿,儿时,儿鱼,允指,元宝,元宵,元年,元贝,先吃个,先头,先生,免费,兔,兔头,兔爷,兔腰,兔腿,全,全味,全家福,全爆,全羊,全聚德,全蟹,全鱼,八,八仙,八件,八味,八宝,八府,八斗,八旗,八段,八爪,八爷,八珍,八色,公,公主,公司,公炒,公社,六合,六秒,六运,兰州,兰溪,关中,兵,养生,养鸡,冒,冒脑花,冒菜,农夫,农家,冬瓜,冬荫功,冬菜,冬阴功,冰,冰川,冰浸,冰激凌,冰火,冰烧,冰球,冰窖,冰粉,冰粥,冰糖,冰脆,冰草,冰菜,冰镇,冲天,冷,冷锅,冷面,冻,净,凉,凉拌,凉浸,凉皮,凉粉,凉糕,凉菜,凉衣,凉面,几,凤凰,凤尾,凤梨,凤爪,凤香蓉,凯撒,凹锅,出,刀削,划,刘家,刺身,剁,剁椒,剔,剔骨,剥河,剥笋,剪刀,功夫,功德,加东,加吉,加虾,劲,勇,包,包包,包子,包心菜,包捉,包浆,包烤,包肉,包菜,包鸡,化皮,北京,北京味,北京烤,北极,北海道,匙,匹夫,十三,十三幺,十三香,十八,十满香,十秒,十里香,千,千丝,千叶,千品,千层,千岛,千岛湖,千张,千页,升级,午餐,半份,半只,半套,半条,半筋,半肉,华德,单饼,南,南乳,南昌,南汇,南洋,南瓜,南瓜饼,南美,南翔,南越,卜,卜甲,卤,卤水,卤粉,卤肉,卤蛋,卤面,卤鸡,卤鸭,卫粘,印尼,印巷,印度,印象,卷,卷子,卷肉,卷饼,压,厚,厚切,厚多士,厚多士配,原创,原只,原味,原汁,原生态,厦门,厨娘,厨水,厨神,参汤,參湯,叉叉,叉烧,叉烧包,及,及第,双,双味,双层,双拼,双椒,双肠,双色,双骄,发现,发芽,口口脆,口味,口水,口水鸡,口蘑,口袋,古,古井,古教水,古法,叫,叫化,叫花,可乐,台塑,台式,台湾,叻,叻沙,吃,吃豆腐,吃货,合拼,合菜,吉士,吉拉多,吊,吊子,吊梨,吊炉,吊烧,吊锅,吊龙,吊龙伴,同庆,吐司,吧,吮指,吸粉,呆,呛,味,味炸,味素,味菇,和,和牛,咕咾,咕噜,咕老肉,咖哩,咖喱,咖喱味,咖喱鸡,咯吱,咱家,咸,咸亨,咸水,咸肉,咸菜,咸蛋,咸鱼,咸鸡,品海,响油,响铃,唇,唐宫,唐府,唐廊,啖,啤酒,啫啫,喉,喜气洋洋,喜饼,喳喳,嘎巴,嘎鱼,嘴巴,嘴魚,四,四味,四品,四喜,四城,四季,四季豆,四宝,四川,四色,四角,四重奏,回族,回锅,团圆,团子,团鱼,园子,国宴,圆子,圆白菜,圈,圈子,土,土匪,土炉,土猪,土盆,土笋,土耳其,土豆,土豆泥,土豆片,土豆皮,土豆饼,土鸡,圣子,在江湖里翻滚的,地,地瓜,地道,地锅,坎,坑,块,坛,坛子,坨,城池,培根,基围,堂蒸,堆,堡,塔,塔克,塔塔,塘鱼,塞外,塞肉,墨,墨汁,墨玉,墨西哥,墨鱼,壹心,壹米家,夏威夷,夏氏,外婆,多,多嘴,多士,多宝,大,大丰收,大串,大刀,大列,大力,大咖,大咧,大头菜,大娘,大拌,大捞,大排,大明,大棒,大汤,大漠,大煮,大王,大盘,大盘鸡,大碗,大肉,大肠,大董,大葱,大蒜,大虾,大蝗,大赢家,大赤,大酱,大锅,大闸,大饼,大骨,大骨棒,大骨煲,大鹅,大麻,大黄,大黄鱼,大龙虾,天下第一,天使,天妇罗,天津,天目湖,天鹅,天麻,太原,太子,太安,太湖,太阳,太雕,夫妻,头,头汤,头牌,头菜,夸张的,夹,夹肉,夹膜,奇味,奇妙,奇石,奇香,套,套餐,奥巴马,奥灶,奶,奶沙,奶油,奶牛,奶皇包,奶豆腐,奶酪,奶香,奶香手,奶黄,好吃,好味,好味酱,妆成,妈妈,妙龄,妹,姊妹,姐夫,姑妈,姑娘,姜,姥姥家,威哥,娃娃,娜,婺江,嫩,嫩肉,子,子排,孔乙己,孔府,孔门,孜然,宁乡,宁波,它,宅门,安妮,安格斯,宋嫂,官府,宝盒,宝翠,宝轩,客家,客语,宫,宫保,宫保鸡,宫廷,宫爆,宫爆鸡丁,家,家乡,家常,宽塘,宽粉,密制,富春老,富贵,寸骨,对,对虾,寿司,封,将,小,小上,小串,小丸子,小件,小份,小公,小公鸡,小刀,小厨,小吃,小品,小土豆,小城,小妹,小巴,小弟,小排,小料,小杨,小桥,小榄,小炒,小牛肉,小猪猪,小球,小白菜,小白龙,小确幸,小碗,小笼,小笼包,小米,小米椒,小米粥,小肘,小肠,小腰,小花,小茴香,小豆,小辣望,小郡,小酥,小锅,小镇,小面,小馆,小鸡,小黄,小龍,小龙,小龙虾,尖,尖叫,尚品,尾,局,局气,屁股,层面,居,居大,居家,屋肋排,屠场,山丘,山地,山寨,山楂,山水,山王,山茶花,山药,山菌,山里红,岐山,岩烤,峰,嵌,川,川北,川味,川霸,左宗棠,巧克力,巧拌,巨无霸,巴,巴沙,巴蜀,巴西,市井,帕尔马,帕里,帝王,带,带子,带鱼,干,干丝,干子,干捞,干炒,干炸,干烧,干烧鳝,干煎,干煸,干肉,干菜,干贝,干酪,干锅,干锅手,平桥,平遥,平锅,年代,年糕,广东,广式,庐山,底,建,建水,开,开心,开片,开胃,开背,开门红,弄堂,张,张氏,张飞,弯弯,当头,彩虹,徐家,御品,微风,德国,德国式,德天,德州,德式,德莫利,心,心太软,必点,怒火,怜惜,怡园,怡煲,怪味,怯勺,总动员,悦蓉,情妹,惊喜,惠灵顿,想,意,意大利,意式,意粉,慈城,慕斯,成都,我,我爱,戛纳,扁豆,扇子,扇贝,手,手作,手切,手卷,手工,手打,手抓,手撕,手锤,扒,扒汁,打,打鲜,扣,扣肉,扬州,扯,抄手,抓,抓虾,抗氧化,折,折罗,抛饼,披萨,抹茶,抻,担仔,担担,拆,拇指,拉,拉皮,拉糕,拉面,拌,拌菜,拍,拐子,拔丝,拖,招牌,拼,拼盤,拼菜,拾味骨,拾味鱼,拾年,拿破仑,挑,挞,挪威,捞,捣蛋,掌,掌中宝,排,排条,排骨,排骨汤,探鱼,提拉,搭,摇滚,摩登,撒尿,撕,撕饼,撕鸡,擀,擂,擂椒,散,整只,文,文东,文和友,文思,文昌,文杏鸡,文火,文鱼,斑,斑鱼,斗牛士,斗碗,料理,新,新加坡,新奥尔良,新封,新派,新疆,新西兰,新鲜,无锡,无骨,日,日式,日本,时蔬,旺池,旺炉,旺角,明,明湖,明珠,明虾,星星,星级,春,春卷,春天,春笋,春饼,春鸡,晓宇嫩,普洱,普罗旺斯,晾干,晾衣架,暹罗,更,月亮,月牙,月饼,有机,有滋有味,朗姆,望京,木,木屋,木桶,木瓜,木须,本初,本家,本帮,杀猪,杂,杂拌,杂汤,杂粮,杂菌,杂菜,杂锦,杂鱼,李师傅,李雪,杏仁,杏鲍,杏鲍菇,条,条子,条虾,来,来了,来自,来自星星的,杨府,杭州,杭椒,杯,松仁,松子,松茸,松阪,松露,松饼,松鼠,板,板筋,板蓝根,板鸭,极品,极致,果仁,果味,果木,枣沫糊,枣泥,架,柄,柠桔,柠檬,柠檬黄,柳,柳木,柳枝,柴,柿子,栗子,栲栳,栳,核,核桃,根粉,桂,桂林,桂林山水,桂花,桂鱼,桃之夭夭,桃仁,桃园,桃花,桑巴,桑拿,桔子,桶,梁山,梅,梅园,梅子,梅干菜,梅汁,梅肉,梅花,梅菜,梅香,梨,梨球,梨香,梭子,梭子蟹,梭边,棉花,棒,棒子,棒骨,森林,椒,椒盐,椒麻,椰,椰子,椰汁,椰香,楼,概念,榄,榆林,榕港,榴芒,榴莲,樟茶,樱桃,橄榄油,檬,歌乐山,正东,武大郎,武昌,武昌鱼,武林,武汉,段,母,母老虎,比尔,比脸,毛,毛氏,毛肚,毛蟹,毛血旺,毛豆,民国,民间,气,气锅,气锅鸡,水,水上漂,水云,水库,水晶,水果,水煎,水煎包,水煮,水煮鱼,水爆,水盆,水竹,水笋,水豆腐,水饺,汁,汉堡,汉家,汉水,汉阳,汗炉,江,江南,江团,江油,江湖,江湖情,江白,江石,江米,江雪,池塘,汤,汤丝螺,汤包,汤团,汤圆,汤底,汤河粉,汤锅,汤鱼,汽锅,沁,沂蒙山,沙,沙丹,沙包,沙参,沙姜,沙姜鸡,沙律,沙拉,沙湾,沙爹,沙田,沙盖,沙茶,沙锅,沙鱼,没吃过,河,河内,河渡,河粉,河虾,河虾仁,河豚,沸腾,油,油塔,油旋,油条,油泼,油浸,油淋,油淋鸡,油渣,油炸,油焖,油燜,油爆,油碟油,油糕,油耗,油豆,油锅,油鳝,油鸡,油麦,沾,沾酱,泉水,法,法国,法式,泡,泡椒,泡泡,泡菜,泡面,泡饼,泡馍,波士顿,泥,泥鳅,泰和,泰国,泰式,泰汁,泰皇,泼辣,洄,洋,洋芋,洋葱,洛神,洛阳,洞庭,津,津典,津味,洪湖,活,活体,活虾,派,流,流星,流沙,浇,浇汁,济南,浓,浓汤,海,海丁,海南,海参,海味,海底,海瓜子,海皇,海肠,海胆,海草,海虾,海蛎,海蛎子,海蛰,海螺,海蟹,海鲜,润鱼,涮,涮肚,液氮,淇,淋,淮安,淮王,深井,深水,深海,混,混椒,混酱,淹城,清宫,清心,清江,清汤,清炒,清蒸,清远,清酒,渍,渝利,渣,渤海湾,温泉,港式,湄公,湖,湖蟹,湘,湘宴,湘式,湘汇,湘西,湛江,湿,溜,溪,滇味凉,滋味,滋补,滑,滚,滚石,满园,满堂红,漂亮,漂亮的,漠北,潘金莲,潮,潮州,潮汕,潮福,澳洲,澳门,濑尿,灌,灌汤,灌肠,火之歌,火山,火山石,火方,火火,火烧,火焰,火燎,火爆,火盆,火腿,火车,火车头,火锅,火龙,灯影,灰,灵隐寺,灶台,炉火,炒,炒年糕,炒意,炒河粉,炒粉,炒肉,炒肝,炒花,炒菜,炒蛋,炒螺片,炒蟹,炒面,炒饼,炒鸡,炒鸡蛋,炖,炖式,炖排骨,炙,炝,炭,炭火,炭烤,炭烧,炭舍,炸,炸丸子,炸气,炸糕,炸腐皮,炸软壳,炸酱,炸醋,炸鱼,炸鸡,点心,炼乳,烂糊,烙,烙饼,烟熏,烟笋,烤,烤千页,烤大茄,烤枣,烤生,烤羊,烤羊肉串,烤肉,烤薯,烤饼,烤鱼,烤鹿,烧,烧卖,烧味,烧椒,烧汁,烧河,烧肉,烧腊,烧裙,烧鸡,烧鸭,烧鹅,烧麦,烩,烩面,烫,热干,热气,烹,焖,焗,焦,焦溜,焦糖,焦香,煎,煎局,煎肉,煎蛋,煎酿,煎饼,煎饼果子,煤,照烧,煨,煮,煲,煲仔,煲汤,煸,熊掌,熏,熏肉,熔岩,熔岩流,熘,熘鱼片,熟,燃,燃烧,燒味,燕窝,燻,爆,爆大,爆散丹,爆汁,爆浆,爆炒,爆烤,爆肚,爆肚儿,爆虾,爆螺,爆酱,爆鳝,爆鸡,爪,爬,爱,爱情,爷爷,爸爸,爽口,片,片儿,片片,片皮,版纳,牌九,牙签,牛,牛三哥,牛丸,牛仔,牛初乳,牛堡,牛奶,牛小排,牛尾,牛尾汤,牛扒,牛排,牛排肉,牛杂,牛柚果,牛柳,牛气,牛河,牛油,牛油果,牛眼,牛窝骨,牛筋,牛羊,牛肉,牛肉汤,牛肉粒,牛肋,牛肋排,牛肚,牛肝菌,牛腩,牛舌,牛蛙,牛首,牛骨,牛魔王,牛黄,牡丹,牦牛,牦牛肉,特价,特制,特味,特色,特选,特香鸡,状元,狄公,狗不理,狗肉,独,独元,独家,狮子头,狮麟,猪,猪仔,猪头肉,猪手,猪扒,猪排,猪杂,猪油,猪肉,猪肘,猪肚,猪肝,猪肠,猪脑,猪脚,猪血,猪蹄,猪颈,猪颈肉,猪骨,猫,玉兰,玉米,玉米片,玉米饼,王,王品,王奇,王婆,王府,王献之,王粉,玫瑰,现制,现场,现炸,现烙,玻璃片,珊瑚,珍宝,珍珠,班尼,球,琵琶,瑞士,瓜子,瓦片,瓦缸,瓦罐,甘薯,甜,甜品,甜汁,甜沫,甜甜,甜筒,甜虾,甜蜜蜜,生,生吃,生态,生打,生抠鲜,生拌,生煎,生煎包,生菜,生蚝,生鸡,甩,田,田式,田螺,田鸡,甲,申海,电,留香,番茄,番薯,疙瘩,疙瘩汤,瘦肉,白,白云,白切,白吉,白斩,白水,白汤,白灼,白玉,白米,白糖,白肉,白脱,白菜,白菜叶,白贝,白鱼,百万,百叶,百叶结,百合,百姓,百岁,百年,百花,的,皇,皇上,皇牌,皇蒸,皇酱,皇饺,皇鹅肠,皮,皮包,皮子,皮皮,皮皮虾,皮蒜,皮蛋,皮鸡,盆,盆子,盆栽,盆花,盆菜,盐,盐帮,盐水,盐焗,盐焗鸡,盒,盒子,盗汗,盘,目鱼,盱眙,相思,眉州,真,眼睛,眼肉,知味,知己,石头,石屏,石榴,石河子,石烤,石烹,石煮,石爆,石磨,石蘑,石蛙,石锅,石鸡,砂锅,碌,碎,碗,碟,碧玉,碧绿,碧螺,碧螺春,碳,碳烧,磨,磨豆腐,神仙,神马,福,福缘,福茂源,禾,秀,私家,私房,秋刀,秋天,秋葵,科罗娜,秒,秘制,秘汁,秘酱,秘醬,秦派,秦镇,稀,稍梅,稻草,稻香,空心,空心菜,空运,空间,窑,窝蛋,窝边草,窝骨,立方,章,童子,童年,竹,竹串,竹笙,竹筒,竹筒饭,竹篮,竹荪,笃,笃笃,笋,笋丁,笋壳,笋尖,笋干,笑颜,笔筒,笔管,第一,第一排,第一碗,第一罐,筋,筋饼,筐,筒,签,签签,箍,篮,簋,米,米有,米粉,米线,米苏,籽,粉,粉丝,粉底,粉条,粉皮,粉蒸,粑,粑粑,粒,粗粮,粘,粢,粤,粤式,粥,粽子,精品,精排,精选,糊,糊小,糊涂,糊饼,糍,糍粑,糕,糖,糖拉利玛,糖油,糖芋,糖蒜,糖醋,糖饼,糙米,糟,糟溜,糯米,糯香,糯香掌,系列,素,素菜,素颜,素馅,紫气东来,紫砂,紫苏,紫薯,紫阳,綠茶,纠结,红,红子,红杏,红果,红枣,红柳,红汤,红油,红烧,红焖,红白,红盖,红米,红米肠,红糖,红花,红薯,红虾,红豆,红酒,红锅,红颜,纸包,纸卷,纸牌,纽奥良,组合,绍兴,经典,结,绝代,绝对,绿色,绿茶,绿野仙踪,缺锅,罐,罐焖,罐罐,罐闷,罗兰,罗汉,罗非,罗非鱼,罾蹦,羊,羊拐,羊排,羊杂,羊棒,羊肉,羊肉串,羊肉汤,羊腿,羊蝎子,羊血,羊骨,美,美人,美国,美容,美式,美极,美玲,美腿,美蛙,美龄,羔,羔羊,羲,羹,翅,翅中,翡翠,老,老北京,老厨,老友,老坑,老坛,老头儿,老奶,老妈,老姑,老婆,老实人,老屋,老干妈,老式,老杭热,老板,老母,老汤,老油条,老满,老火,老爆,老爸,老碗,老糖,老街,老谭,老豆腐,老酒,老醋,老陕,老鸭,考伯,耗儿,耙,耳朵,耳根,肉,肉丝,肉串,肉丸,肉卷,肉夹,肉拌,肉末,肉条,肉松,肉汁,肉沫,肉燥,肉片,肉皮,肉盖,肉眼,肉碎,肉筋,肉肠,肉腸,肉蟹,肉酱,肉食,肉饼,肉骨,肉龙,肋,肋条,肋骨,肘,肘子,肚,肝,肝包,肝尖,肝果,肝酱,肠,肠粉,肥,肥牛,肥肠,肺,肺头,肺片,胗,胚子,胡桃,胡桃里,胡椒,胡辣汤,胶东,胶油条,胼,脆,脆嫩,脆皮,脆肉,脆肚,脆肠,脆饼,脆骨,脆鳝,脊,脊骨,脊髓,脑,脑壳,脑花,脖仁,脚,脱骨,脸,腊,腊八,腊味,腊肉,腌,腐,腐乳,腐皮,腐竹,腐衣卷,腔骨,腩,腰子,腰花,腱,腿,膀,膏,膏蟹,膝,膳,膳段,膳糊,臊子,自,自制,自助,自家,自选,自酿,臭,臭豆腐,至尊,舌,舌头,舒友,舒芙蕾,舟山,船夫,艇,色,色拉,芋儿,芋头,芋艿,芋蓉豬,芒果,芙蓉,芝士,芝心,芝麻,芝麻酱,芥末,芥茉,芥辣捞,芥香,芫,芭蕉叶,花,花卷,花厨,花家,花旗,花旗参,花椒,花江,花溪,花生,花生仁,花生酱,花甲,花菜,花蛤,花螺,花蟹,花轿,花雕,花馍,花鸡,芳香,芸豆,芹菜,苏,苔条,苔菜,苕,苗,苗家,苗王,苜蓿,苦菊,范家,茄,茄丁,茄子,茄条,茄龙,茅台,茉莉,茉莉花,茴香,茶,茶叶,茶坊,茶壶,茶树,茶树菇,茶香,茸,茹,茼蒿,草,草原,草头,草帽,草莓,草菇,荔枝,荔湾,荞,荞麦,药,药膳,荷包蛋,荷叶,荷塘,荷庭,荷花,莎莎,莎莎酱,莓心莓,莜,莜面,莫吉托,莫斯科,莲白,莲蓉,莲藕,莳萝,莼菜,菇,菊花,菌,菌菇,菜,菜包,菜团子,菜心,菜汤,菜花,菠菜,菠萝,菠萝包,菩提,菲力,萝卜,萝卜丝,葡式,葡挞,董家,董氏,葫芦,葱,葱头,葱椒,葱油,葱油鸡,葱烤,葱烧,葱花,葱香,葱香豉,蒙古,蒜,蒜汁,蒜泥,蒜蓉,蒜香,蒸,蒸元贝,蒸多宝,蒸牛小排,蒸笼,蒸经,蒸肉,蒸蛋,蒸饭,蒸饺,蒿,蓉,蓝莓,蓝莲,蓝蛙,蓬蒿,蔬菜,蕃茄,蕉叶,蕨,蕨根,薄切生,薄烧,薄荷,薄饼,薛府,薯,薯条,薯泥,薯片,薯角,薰,藕,藕丝,藕片,藜,藤椒,藿香,蘑菇,虎,虎皮,虹鳟,虾,虾丸,虾仁,虾卷,虾尾,虾片,虾球,虾生,虾皇,虾肉,虾膏酿,虾茸,虾贝,虾酱,虾饼,蚆,蚌,蚕豆,蚝,蚝油,蚬,蚵,蚵仔,蛇,蛋,蛋挞,蛋白,蛋糕,蛋蛋,蛋黄,蛎,蛏,蛏子,蛙,蛙腿,蛟,蛤,蛤蜊,蛰头,蛸,蜀,蜀府,蜂窝,蜂窝煤,蜂蜜,蜗牛,蜜枣,蜜桃,蜜汁,蜜糖,蜜辣,蝎子,蝴蝶,螃,螃蟹,螺,螺丝,螺片,螺狮粉,螺蛳,蟹,蟹粉,蟹肉,蟹肉汤,蟹膏,蟹黄,血,血肠,街,街头,表哥,西,西冷,西北,西域,西多士,西川,西府,西施,西旗,西杏炸,西柚,西湖,西班牙,西红柿,西贝,西贝大拌,西贡,观音,角包,解馋,让,论教,话梅,诱惑,谁动,调味,豆,豆子,豆汤,豆沙,豆油,豆泥,豆瓣,豆皮,豆皮刷,豆腐,豆腐皮,豆腐脑,豆花,豆苗,豆角,豆豉,豉,豉汁,豉油,豌杂,豌豆,豌豆苗,象形,象拔,象拔蚌,象鼻,豬仔,贝,贝勒,贝勒爷,贡梅,贰楼,贴饼子,费尼,赤豆,走地,超市,超级,超越,越南,越式,趾,跨,路边,跳,跳水,跳舞,跳跳,踩,蹄,蹄筋,蹄膀,蹄花,蹦,车仔,转角,软,软兜,软猪,软骨,轰炸,轻盈,辣,辣味,辣子,辣子鸡,辣宴,辣得,辣椒,辣翅,边炉,辽参,过桥,过油肉,连汤,迪克,迷你,退秋,送,通菜,遇上,遇到,道口,道味,道菜,避风塘,邕城,那,那年,那府,邵式,邻居家,鄂伦春,配,配椰香,酒,酒家,酒酿,酒阳,酒香,酥,酥方,酥皮,酱,酱椒,酱汁,酱油,酱烧,酱爆,酱爆香螺,酱碗,酱筋,酱肉,酱闷,酱香,酱骨,酱骨王,酱鸭,酸,酸梅,酸汤,酸甜,酸笋,酸菜,酸豆角,酸辣,酸辣汤,酿,酿皮,酿皮子,醉,醉鸡,醋,醋木,醋椒,醋溜,醪糟,里,里拉,里脊,重庆,野生,野菌,野菜,金不换,金丝,金丝小枣,金刚,金包,金华,金奖,金枪,金汤,金沙,金牌,金球,金瓜,金线,金网,金蒜,金酱,金针,金针菇,金钱,金银,金饼,銚,钟水,钢管,钢管舞,钳,钵子,钵钵,铁勺,铁板,铁板烧,铁棍,铁锅,铜,铜锅,铜锣,银,银丝,银心,银鱼,销魂,锅,锅中锅,锅包,锅包肉,锅巴,锅底,锅汤,锅盔,锅贴,锅边,锅魁,锡纸,锡蒙,锡香,锣鼓,锦城,锦庐,锦府,锦绣,长安,长江,长沙,长脚,长茄,闫府,闷,闷烧,闷骚,阳光,阳春,阿五,阿婆,阿庄,阿拉斯加,阿杜一绝,阿根廷,阿紫,阿胶,陈村,陈村粉,陈皮,陈皮油,陕菜,陕西,陶陶,随缘,雪,雪媚娘,雪山,雪梅娘,雪梅酿,雪砖,雪糕,雪花,雪菜,雪蟹,雪豆,雷公,雾凇,霜降,露,露鹅肝包,霸王,霸道,青,青口,青岛,青年,青春,青木瓜,青柠,青柠蒸,青梅,青椒,青稞,青笋,青红,青芥,青蛙,青豆,靓,靓汤,靓靓,非,非一般,面,面包,面包片,面拖大,面条,面片,面疙瘩,面皮,面筋,面线,面茶,鞋底,韩国,韭菜,顶级,顺德,顺溜,顺风,须,领鲜,颈,颈肉,风,风光,风味,风干,风情,风熏,风秘,风花雪月,飘香,飞,食为,食客,食尖兒,食神,餐前,饭,饵块,饷,饺,饼,饽饽,馄饨,馅,馅满,馅饼,馇,馋嘴,馍,馍馍,馒头,馕,首创,香,香兰,香叶,香味,香囊,香大,香妃,香嫩,香油,香港,香烤,香煎鹅肝,香熏,香肠,香肴,香脆,香芋,香芒,香茅,香茅草,香草,香菇,香菜,香葱,香蕉,香薰,香螺,香袋,香辣,香辣蟹,香酥,香锅,香颂,香饼,香骨,香鸡,马,马兰,马家沟,马德里,马来,马桥,马苏,马贝,马蹄,驴,驴打滚,驴肉,骄子,骨,骨头,骨架,骨棒,骨汤,骨肉,骨肉相连,骨锅,髈,高压,高原,高庄,高炉,高钙,鬼马,魔芋,魔鬼,魚,鮰,鱼,鱼丸汤,鱼唇,鱼排,鱼汤,鱼渣,鱼滑,鱼片,鱼翅,鱼肚,鱼腩,鱼花,鱼蛋,鱼露,鱼面,鱼饭,鱼香,鱼香茄子,鱼鱼,鱿,鱿鱼,鲁肉,鲅,鲈,鲍,鲍汁,鲑,鲑鱼,鲜,鲜果,鲜椒,鲜椒水,鲜油,鲜肉,鲜花,鲜蔬,鲜蘑,鲜虾,鲜锅,鲜鸭肠,鲜鸭血,鲢,鲤,鲤鱼,鲥,鲩,鲫,鲳,鲳鱼,鲶,鲶鱼,鲽,鳕,鳕鱼,鳗,鳜,鳝,鳝段,鳝片,鳝糊,鳞,鸟巢,鸟贝,鸡,鸡丁,鸡丝,鸡中,鸡仔,鸡公,鸡包,鸡捞,鸡排,鸡杂,鸡毛,鸡汁,鸡汤,鸡油生,鸡煲,鸡爪,鸡生,鸡粒,鸡翅,鸡肉,鸡胸肉,鸡腿,鸡蓉,鸡蛋,鸡血,鸡里,鸡饭,鸡骨,鸡鸣,鸦片,鸭,鸭儿,鸭唇,鸭嘴,鸭头,鸭子,鸭心,鸭掌,鸭方,鸭架,鸭油,鸭溪,鸭肉,鸭肝,鸭肠,鸭舌,鸭蛋,鸭血,鸭蹼,鸳鸯,鸳鸯锅,鸽,鸽子,鸽肾,鸿运,鹅,鹅掌,鹅肝,鹅肠,鹌鹑,鹿,鹿儿,鹿儿岛,鹿肉,麦,麦片,麸,麻,麻什,麻仁,麻婆,麻婆豆腐,麻将,麻小,麻椒,麻球,麻花,麻辣,麻酱,麻食,麻香,麻麻,黄,黄县,黄喉,黄山,黄排,黄桂粥,黄桃,黄桥,黄氏,黄河,黄油,黄焖,黄猴,黄瓜,黄米,黄粑,黄糖,黄花,黄花鱼,黄蒸,黄蘑,黄豆,黄辣,黄金,黄骨,黄鱼,黄鳝,黎蒿,黑,黑曜石,黑松,黑森林,黑椒,黑毛,黑牛,黑米,黑糖,黑胡椒,黑芝麻,黑蒜子,黑鱼,鼎,鼎鲜,龍虾,龙井,龙凤,龙利,龙头,龙抄手,龙脂,龙虾,龙须菜,龙骨,龟"


  def main(args: Array[String]) {
    println("useage: args(0): inputPath  args(0):recipTopN")
    var recipTopN = 50;
    var inputPath = "/user/hadoop/ufsClusterInput/ufs-recipe-word.csv"
    if (args.size > 0) {
      inputPath = args(0)
    }
    if (args.size > 1) {
      recipTopN = args(1).toInt
    }

    println("params: inputPath:" + inputPath + " recipTopN:" + recipTopN)
    val conf = new SparkConf().setAppName("RestaurantCluster")
    val sc = new SparkContext(conf)
    val recipesArrayBc = sc.broadcast[Array[String]](recipes.split(","))
    val sqlContext = new SQLContext(sc)
    val allResult = sc.textFile(inputPath).map { line => splitLine(line, recipesArrayBc) }.reduceByKey(_ ++ _).mapValues(list => {
      val recipeNums = scala.collection.mutable.Map.empty[String, Int]
      list.map(recipeNum => {
        val oldNum = recipeNums.get(recipeNum._1)
        if (oldNum != None) {
          recipeNums.put(recipeNum._1, oldNum.get + recipeNum._2)
        } else {
          recipeNums.put(recipeNum._1, recipeNum._2)
        }
      })
      recipeNums
    })
    allResult.cache()
    import org.apache.spark.SparkContext._

    //    val sample = allResult.take(2500)
    val recipeMapAll = allResult.flatMap { x =>
      {
        x._2.toSeq
      }
    }.aggregate(scala.collection.mutable.Map.empty[String, Int])(seqOp, combop).map(x => (x._2, x._1))

    val recipeTop = sc.parallelize(recipeMapAll.toSeq).sortByKey(false).take(recipTopN)
    val top_recipe_orderMap = sc.parallelize(recipeTop).map(f => f._2).zipWithIndex().collect().toMap
    //    val restaurantMap = sample.map { x => x._1 }.aggregate(scala.collection.mutable.Set.empty[String])(_ + _, _ ++ _).zipWithIndex.toMap
    //    val restaurantMapBC = sc.broadcast(restaurantMap)
    val top_recipe_orderMapBC = sc.broadcast(top_recipe_orderMap)
    val formatResult = allResult.map { record =>
      {

        val array = Array.fill(recipTopN)(0.0)
        record._2.map(x => {
          if (x._2 > 0) {

            val recipeId = top_recipe_orderMapBC.value.get(x._1);

            if (recipeId != None) {
              array(recipeId.get.toInt) = 1.0
            } 
          }
        })

        var result = record._1 + ""
        val size = recipTopN - 1
        for (i <- 0 to size) {
          result = result + " " + (i + 1) + ":" + array(i.toInt)
        }
        result
      }
    }
    sc.parallelize(recipeMapAll.toSeq).saveAsTextFile("/user/hadoop/ufsCluster/Dir_recipeMapAll_word_binary" + recipTopN)
    sc.parallelize(recipeTop).saveAsTextFile("/user/hadoop/ufsCluster/Dir_recipeTop_word_binary" + recipTopN)
    sc.parallelize(top_recipe_orderMapBC.value.toSeq).saveAsTextFile("/user/hadoop/ufsCluster/Dir_recipeMapTop_word_binary" + recipTopN)
    formatResult.saveAsTextFile("/user/hadoop/ufsCluster/Dir_formatResult_word_binary" + recipTopN)
  }

  def splitLine(line: String, recipesArrayBc: Broadcast[Array[String]]): (String, scala.collection.mutable.ListBuffer[(String, Int)]) = {
    val recipeNums = scala.collection.mutable.ListBuffer.empty[(String, Int)]
    val countArray = line.split(",", 4204);
    var i = 0;
    val lenth = recipesArrayBc.value.size
    while (i < lenth) {
      recipeNums.+=((recipesArrayBc.value(i), countArray(i + 4).toInt))
      i = i + 1
    }
    countArray(0) -> recipeNums
  }
  
  
  def seqOp(U: scala.collection.mutable.Map[String, Int], T: (String, Int)): scala.collection.mutable.Map[String, Int] = {

    val oldNum = U.get(T._1)
    if (oldNum != None) {
      U.put(T._1, oldNum.get + T._2)
    } else {
      U.put(T._1, T._2)
    }
    U
  }
  def combop(U1: scala.collection.mutable.Map[String, Int], U2: scala.collection.mutable.Map[String, Int]): scala.collection.mutable.Map[String, Int] = {
    U2.seq.map(T => {
      val oldNum = U1.get(T._1)
      if (oldNum != None) {
        U1.put(T._1, oldNum.get + T._2)
      } else {
        U1.put(T._1, T._2)
      }
    })
    U1
  }
}